# MultistoryStairDoesntReach Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultistoryStairDoesntReach Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The multistory stair/ramp could not reach its top level with integral number of flights. Maximum number of flights below the top level is created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultistoryStairDoesntReach { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStairDoesntReach As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultistoryStairDoesntReach {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace